{
  "name": "ojRadioset",
  "version": "4.1.0",
  "jetVersion": "4.1.0",
  "displayName": " Radioset",
  "preview": true,
  "roles": [
    "radio",
    "radiogroup",
    "option"
  ],
  "styleClasses": [
    {
      "styleGroup": [
        "oj-choice-direction-column"
      ],
      "description": "This is the default. It lays out the radios in a column."
    },
    {
      "styleGroup": [
        "oj-choice-direction-row"
      ],
      "description": "It lays out the radio buttons in a row."
    },
    {
      "styleGroup": [
        "oj-radioset-no-chrome"
      ],
      "description": "Use this styleclass if you don't want the chrome around the set."
    },
    {
      "styleGroup": [
        "oj-radioset-input-start"
      ],
      "description": "Use this styleclass to order the radio at the start and label text at the end even if a theme has a different default order."
    },
    {
      "styleGroup": [
        "oj-radioset-input-end"
      ],
      "description": "Use this styleclass to order the radio at the end and the label text at the start even if a theme has a different default order."
    }
  ],
  "description": "Radio Set Element",
  "properties": {
    "describedBy": {
      "description": "It is used to establish a relationship between this component and another element.\nTypically this is not used by the application developer, but by the oj-label custom element's\ncode. One use case is where the oj-label custom element code writes described-by\non its form component for accessibility reasons.\nTo facilitate correct screen reader behavior, the described-by attribute is\ncopied to the aria-describedby attribute on the component's dom element.",
      "type": "string",
      "displayName": "Described By"
    },
    "disabled": {
      "description": " Disabled true disables the component and disables all the inputs/labels. Disabled false enables the component, and leaves the inputs' disabled property as it is in the dom. ",
      "type": "boolean|null",
      "displayName": "Disabled",
      "value": false
    },
    "displayOptions": {
      "description": "Display options for auxilliary content that determines where it should be displayed \nin relation to the component. \n\n\nThe types of messaging content for which display options can be configured include \nmessages, converterHint, \nvalidatorHint and helpInstruction.\nThe display options for each type is specified either as an array of strings or a string. When \nan array is specified the first display option takes precedence over the second and so on. \n\n\nJET editable components set defaults that apply to the entire app/page. \nIt is possible to override the defaults on \na per instance basis as explained in the examples below or change defaults for the entire\napplication using \noj.Components#setDefaultOptions method.\nIt is much easier to change the defaults using setDefaultOptions once rather than putting\nthe displayOptions option on every component instance.\n\n\nWhen display-options changes due to programmatic intervention, the component updates its \ndisplay to reflect the updated choices. For example, if 'help.instruction' property goes from \n'notewindow' to 'none' then it no longer shows in the notewindow.\n\n\nA side note: help.instruction and message detail text can include formatted HTML text, whereas hints and \nmessage summary text cannot. If you use formatted text, it should be accessible \nand make sense to the user if formatting wasn't there.\nTo format the help.instruction, you could do this:\n<html>Enter <b>at least</b> 6 characters</html>\n",
      "type": "Object|undefined",
      "displayName": "Display Options",
      "value": "{messages: [inline],converterHint: [placeholder,notewindow],validatorHint: [notewindow],helpInstruction: [notewindow]}",
      "properties": [
        {
          "name": "converterHint",
          "description": "supported values are 'placeholder', \n'notewindow', 'none'. The \ndefault value is ['placeholder', 'notewindow']. When there \nis already a placeholder set on the component, the converter hint falls back to display \ntype of 'notewindow'.\nTo change the default value you can do this - \nE.g. {'displayOptions: {'converterHint': ['none']}}",
          "type": "Array|string"
        },
        {
          "name": "validatorHint",
          "description": "supported values are 'notewindow', \n'none'.\nTo change the default value you can do this - \n{'displayOptions: {'validatorHint': ['none']}}",
          "type": "Array|string"
        },
        {
          "name": "messages",
          "description": "supported values are 'notewindow', \n'inline',\n'none'. The default is 'inline'. \nTo change the default value you can do this - \nE.g. {'displayOptions: {'messages': 'none'}}",
          "type": "Array|string"
        },
        {
          "name": "helpInstruction",
          "description": "supported values are 'notewindow', \n'none'.\nTo change the default value you can do this - \nE.g. displayOptions='{\"helpInstruction\": \"none\"}'",
          "type": "Array|string"
        }
      ]
    },
    "help": {
      "description": "Form component help information.\n\nThe properties supported on the help option are:",
      "type": "Object.<string, string>",
      "displayName": "Help",
      "value": "{help : {instruction: null}}",
      "properties": [
        {
          "name": "instruction",
          "description": "this represents advisory information for the component\nThe default value is null.",
          "type": "string"
        }
      ]
    },
    "helpHints": {
      "description": "Represents hints for oj-form-layout element to render help information on the label of the editable component. \nThis is used only if the editable component is added as a direct child to an oj-form-layout element, and the labelHint property is also specified.\n\n\nThe helpHints object contains a definition property and a source property.\n\n\ndefinition - hint for help definition text.\nsource - hint for help source URL.\n",
      "type": "Object.<string, string>",
      "displayName": "Help Hints",
      "value": "{definition: , source: }",
      "properties": {
        "definition": {
          "description": "Hint for help definition text associated with the label. \nIt is what shows up when the user hovers over the help icon, or tabs into the help icon, or press and holds the help icon on a mobile device. No formatted text is available for help definition attribute.\n\nSee the help-hints attribute for usage examples.",
          "type": "string"
        },
        "source": {
          "description": "Hint for help source URL associated with the label. \nIf present, a help icon will render next to the label. For security reasons we only support urls with protocol http: or https:. If the url doesn't comply we ignore it and throw an error. \nPass in an encoded URL since we do not encode the URL.\n\nSee the help-hints attribute for usage examples.",
          "type": "string"
        }
      }
    },
    "labelHint": {
      "description": "Represents a hint for oj-form-layout element to render a label on the editable component. \nThis is used only if the editable component is added as a direct child to an oj-form-layout element.\n\n\nWhen labelHint is present it gives a hint to the oj-form-layout element to create an oj-label element for the editable component.\nWhen the labelHint property changes oj-form-layout element refreshes to \ndisplay the updated label information. \n",
      "type": "string",
      "displayName": "Label Hint"
    },
    "labelledBy": {
      "description": "It is used to establish a relationship between this component and another element. A common use is to tie the oj-label and the oj-radioset together. The oj-label custom element has an id, and you use the labelled-by attribute to tie the two components together.",
      "type": "string|null",
      "displayName": "Labelled By"
    },
    "messagesCustom": {
      "description": "List of messages an app would add to the component when it has business/custom validation \nerrors that it wants the component to show. When this option is set the message shows to the \nuser right away. To clear the custom message, set messagesCustom\nback to an empty array.\nEach message in the array is an object that duck types oj.Message. \nSee Message for details.",
      "type": "Array.<Object>|undefined",
      "displayName": "Messages Custom",
      "value": "[]",
      "writeback": true
    },
    "required": {
      "description": "Whether the component is required or optional. When required is set to true, an implicit required validator is created using the validator factory - oj.Validation.validatorFactory(oj.ValidatorFactory.VALIDATOR_TYPE_REQUIRED).createValidator(). Translations specified using the translations.required option and the label associated with the component, are passed through to the options parameter of the createValidator method. When required option changes due to programmatic intervention, the component may clears message and run validation, based on the current state it's in. Running Validation if component is valid when required is set to true, then it runs deferred validation on the property value. This is to ensure errors are not flagged unnecessarily. if component is invalid and has deferred messages when required is set to false, then component messages are cleared but no deferred validation is run. if component is invalid and currently showing invalid messages when required is set, then component messages are cleared and normal validation is run using the current display value. if there are validation errors, then value property is not updated and the error is shown. if no errors result from the validation, the value property is updated; page author can listen to the optionChange event to clear custom errors. Clearing Messages Only messages created by the component are cleared. messagesCustom option is not cleared. ",
      "type": "boolean",
      "displayName": "Required",
      "value": false,
      "enumValues": [
        "false",
        "true"
      ],
      "propertyEditorValues": {
        "false": {
          "description": "implies a value is not required to be provided by the user. This is the default.",
          "displayName": "False"
        },
        "true": {
          "description": "implies a value is required to be provided by user and the input's label will render a required icon. Additionally a required validator - RequiredValidator - is implicitly used if no explicit required validator is set. An explicit required validator can be set by page authors using the validators option. When the option is not set, the element's required property is used as its initial value if it exists.",
          "displayName": "True"
        }
      }
    },
    "translations": {
      "description": "A collection of translated resources from the translation bundle, or null if this\ncomponent has no resources. Resources may be accessed and overridden individually or collectively, as seen in the examples.\n\nIf this component has translations, their documentation immediately follows this doc entry.",
      "type": "Object",
      "displayName": "Translations",
      "value": null,
      "properties": {
        "required": {
          "description": "Provides properties to customize the summary, detail and hint text used by the\nimplicit required validator associated to any editable component that supports the\nrequired option.\n\nSee the translations attribute and\nrequired option for usage examples.",
          "type": "Object",
          "properties": {
            "hint": {
              "description": "Hint text used by required validation error.\n\nSee the translations attribute for usage examples.",
              "type": "string"
            },
            "messageDetail": {
              "description": "Message text that describes the details of the required validation error.\n\nSee the translations attribute for usage examples.",
              "type": "string"
            },
            "messageSummary": {
              "description": "Message text for summarizing a required validation error.\n\nSee the translations attribute for usage examples.",
              "type": "string"
            }
          }
        }
      }
    },
    "value": {
      "description": "The value of the component. When value option changes due to programmatic intervention, the component always clears all messages and runs deferred validation, and always refreshes UI display value. Clearing Messages All messages are cleared. This includes messagesCustom property. Running Validation component always runs deferred validation ",
      "type": "*",
      "displayName": "Value",
      "value": "null\rWhen the option is not set, the value of the checked radio is used, if a radio is checked.",
      "writeback": true
    }
  },
  "methods": {
    "refresh": {
      "description": "Refreshes the radioset A refresh() is required when a radioset is programatically changed, like in the following circumstances: After radios are added or removed or modified (without using ojRadioset) in the DOM. "
    },
    "validate": {
      "description": "Validates the component's display value using all validators registered on the component and updates the value option by performing the following steps. All messages are cleared, including custom messages added by the app. The implicit required validator is run if the component is marked required. At the end of validation if there are errors, the messages are shown. If there were no errors, then the value property is updated. ",
      "preview": true,
      "return": "Promise"
    },
    "reset": {
      "description": "Resets the component by clearing all messages and messages attributes - \nmessagesCustom -\nand updates the component's display value using the attribute value. User entered values will be \nerased when this method is called."
    },
    "showMessages": {
      "description": "Takes all deferred messages and shows them. \nIf there were no deferred messages this method simply returns. \n\n\nTo view messages user has to set focus on the component. \n"
    },
    "setProperty": {
      "description": "Sets a property or a single subproperty for complex properties and notifies the component\nof the change, triggering a [property]Changed event.",
      "params": [
        {
          "name": "property",
          "description": "The property name to set. Supports dot notation for subproperty access.",
          "type": "string"
        },
        {
          "name": "value",
          "description": "The new value to set the property to.",
          "type": "*"
        }
      ]
    },
    "getProperty": {
      "description": "Retrieves a value for a property or a single subproperty for complex properties.",
      "params": [
        {
          "name": "property",
          "description": "The property name to get. Supports dot notation for subproperty access.",
          "type": "string"
        }
      ],
      "return": "*"
    },
    "setProperties": {
      "description": "Performs a batch set of properties.",
      "params": [
        {
          "name": "properties",
          "description": "An object containing the property and value pairs to set.",
          "type": "Object"
        }
      ]
    }
  },
  "events": {
    "animateStart": {
      "description": "Triggered when a default animation is about to start on an element owned by the component.\n\nThe default animation can be cancelled by calling event.preventDefault, followed by\na call to ui.endCallback. ui.endCallback should be\ncalled immediately after event.preventDefault if the application merely wants to cancel animation, \nor it should be called when the custom animation ends if the application is invoking another animation function. Failure to\ncall ui.endCallback may prevent the component from working properly.\nFor more information on customizing animations, see the documentation of \noj.AnimationUtils.\n\nThe default animations are controlled via the theme (SCSS) :\n\n// default animations for \"notewindow\" display option\n$noteWindowOpenAnimation: (effect: \"zoomIn\", transformOrigin: \"#myPosition\") !default;\n$noteWindowCloseAnimation: (effect: \"none\") !default;\n\n// default animations for \"inline\" display option\n$messageInlineOpenAnimation: (effect: \"expand\", startMaxHeight: \"#oldHeight\") !default;\n$messageInlineCloseAnimation: (effect: \"collapse\", endMaxHeight: \"#newHeight\") !default;\n",
      "bubbles": true,
      "cancelable": true,
      "detail": {
        "action": {
          "description": "The action that triggers the animation. Supported values are: \"inline-open\" - when an inline message container opens or increases in size \"inline-close\" - when an inline message container closes or decreases in size \"notewindow-open\" - when a note window opens \"notewindow-close\" - when a note window closes ",
          "type": "string"
        },
        "element": {
          "description": "The element being animated.",
          "type": "Element"
        },
        "endCallback": {
          "description": "If the event listener calls event.preventDefault to cancel the default animation, it must call the endCallback function when it finishes its own animation handling and any custom animation has ended.",
          "type": "function"
        }
      }
    },
    "animateEnd": {
      "description": "Triggered when a default animation has ended.",
      "bubbles": true,
      "cancelable": true,
      "detail": {
        "action": {
          "description": "The action that triggers the animation. Supported values are: \"inline-open\" - when an inline message container opens or increases in size \"inline-close\" - when an inline message container closes or decreases in size \"notewindow-open\" - when a note window opens \"notewindow-close\" - when a note window closes ",
          "type": "string"
        },
        "element": {
          "description": "The element being animated.",
          "type": "Element"
        }
      }
    }
  },
  "slots": {
    "contextMenu": {
      "description": "The contextMenu slot is set on the oj-menu within this element. \nThis is used to designate the JET Menu that this component should launch as a context menu on right-click, Shift-F10, Press & Hold, or component-specific gesture. \nIf specified, the browser's native context menu will be replaced by the JET Menu specified in this slot.\n\nThe application can register a listener for the Menu's ojBeforeOpen event. The listener can cancel the launch via event.preventDefault(), \nor it can customize the menu contents by editing the menu DOM directly, and then calling refresh() on the Menu.\n\nTo help determine whether it's appropriate to cancel the launch or customize the menu, the ojBeforeOpen listener can use component API's to determine which \ntable cell, chart item, etc., is the target of the context menu. See the JSDoc and demos of the individual components for details. \n\nKeep in mind that any such logic must work whether the context menu was launched via right-click, Shift-F10, Press & Hold, or component-specific touch gesture."
    }
  }
}