{
  "name": "ojSlider",
  "version": "4.1.0",
  "jetVersion": "4.1.0",
  "displayName": "Slider",
  "preview": true,
  "roles": [
    "slider"
  ],
  "styleClasses": [
    {
      "styleGroup": [
        "oj-slider"
      ],
      "description": "Top level slider class."
    },
    {
      "styleGroup": [
        "oj-slider-thumb"
      ],
      "description": "Styles the slider thumb."
    },
    {
      "styleGroup": [
        "oj-slider-bar"
      ],
      "description": "Styles the slider bar. The slider bar spans the full width of a horizontal slider."
    },
    {
      "styleGroup": [
        "oj-slider-bar-value"
      ],
      "description": "Styles the slider bar value. The slider bar value is the colored (blue by default) part of the slider bar."
    },
    {
      "styleGroup": [
        "oj-slider-horizontal"
      ],
      "description": "This class is present when the slider is oriented horizontally."
    },
    {
      "styleGroup": [
        "oj-slider-vertical"
      ],
      "description": "This class is present when the slider is oriented vertically."
    },
    {
      "styleGroup": [
        "oj-focus-highlight"
      ],
      "description": "Under normal circumstances this class is applied automatically. It is documented here for the rare cases that an app developer needs per-instance control.\nThe \"oj-focus-highlight\" class applies focus styling that may not be desirable when the focus results from pointer interaction (touch or mouse), but which is needed for accessibility when the focus occurs by a non-pointer mechanism, for example keyboard or initial page load.\nThe application-level behavior for this component is controlled in the theme by the \"$focusHighlightPolicy\" SASS variable; however, note that this same variable controls the focus highlight policy of many components and patterns. The values for the variable are:\n\"nonPointer\": \"oj-focus-highlight\" is applied only when focus is not the result of pointer interaction. Most themes default to this value.\n\"all\": \"oj-focus-highlight\" is applied regardless of the focus mechanism.\n\"none\": \"oj-focus-highlight\" is never applied. This behavior is not accessible, and is intended for use when the application wishes to use its own event listener to precisely control when the class is applied (see below). The application must ensure the accessibility of the result.\nTo change the behavior on a per-instance basis, the application can set the SASS variable as desired and then use event listeners to toggle this class as needed."
    }
  ],
  "description": "The oj-slider component enhances an HTML input element into an interactive slider",
  "properties": {
    "describedBy": {
      "description": "It is used to establish a relationship between this component and another element.\nTypically this is not used by the application developer, but by the oj-label custom element's\ncode. One use case is where the oj-label custom element code writes described-by\non its form component for accessibility reasons.\nTo facilitate correct screen reader behavior, the described-by attribute is\ncopied to the aria-describedby attribute on the component's dom element.",
      "type": "string",
      "displayName": "Described By"
    },
    "disabled": {
      "description": "Whether the component is disabled. The disabled attribute is used as its initial value if it exists, when the attribute is not explicitly set. When neither is set, disabled defaults to false.",
      "type": "boolean",
      "displayName": "Disabled",
      "value": false
    },
    "displayOptions": {
      "description": "Display options for auxilliary content that determines where it should be displayed \nin relation to the component. \n\n\nThe types of messaging content for which display options can be configured include \nmessages, converterHint, \nvalidatorHint and helpInstruction.\nThe display options for each type is specified either as an array of strings or a string. When \nan array is specified the first display option takes precedence over the second and so on. \n\n\nJET editable components set defaults that apply to the entire app/page. \nIt is possible to override the defaults on \na per instance basis as explained in the examples below or change defaults for the entire\napplication using \noj.Components#setDefaultOptions method.\nIt is much easier to change the defaults using setDefaultOptions once rather than putting\nthe displayOptions option on every component instance.\n\n\nWhen display-options changes due to programmatic intervention, the component updates its \ndisplay to reflect the updated choices. For example, if 'help.instruction' property goes from \n'notewindow' to 'none' then it no longer shows in the notewindow.\n\n\nA side note: help.instruction and message detail text can include formatted HTML text, whereas hints and \nmessage summary text cannot. If you use formatted text, it should be accessible \nand make sense to the user if formatting wasn't there.\nTo format the help.instruction, you could do this:\n<html>Enter <b>at least</b> 6 characters</html>\n",
      "type": "Object|undefined",
      "displayName": "Display Options",
      "value": "{messages: [inline],converterHint: [placeholder,notewindow],validatorHint: [notewindow],helpInstruction: [notewindow]}",
      "properties": [
        {
          "name": "converterHint",
          "description": "supported values are 'placeholder', \n'notewindow', 'none'. The \ndefault value is ['placeholder', 'notewindow']. When there \nis already a placeholder set on the component, the converter hint falls back to display \ntype of 'notewindow'.\nTo change the default value you can do this - \nE.g. {'displayOptions: {'converterHint': ['none']}}",
          "type": "Array|string"
        },
        {
          "name": "validatorHint",
          "description": "supported values are 'notewindow', \n'none'.\nTo change the default value you can do this - \n{'displayOptions: {'validatorHint': ['none']}}",
          "type": "Array|string"
        },
        {
          "name": "messages",
          "description": "supported values are 'notewindow', \n'inline',\n'none'. The default is 'inline'. \nTo change the default value you can do this - \nE.g. {'displayOptions: {'messages': 'none'}}",
          "type": "Array|string"
        },
        {
          "name": "helpInstruction",
          "description": "supported values are 'notewindow', \n'none'.\nTo change the default value you can do this - \nE.g. displayOptions='{\"helpInstruction\": \"none\"}'",
          "type": "Array|string"
        }
      ]
    },
    "help": {
      "description": "Form component help information.\n\nThe properties supported on the help option are:",
      "type": "Object.<string, string>",
      "displayName": "Help",
      "value": "{help : {instruction: null}}",
      "properties": [
        {
          "name": "instruction",
          "description": "this represents advisory information for the component\nThe default value is null.",
          "type": "string"
        }
      ]
    },
    "helpHints": {
      "description": "Represents hints for oj-form-layout element to render help information on the label of the editable component. \nThis is used only if the editable component is added as a direct child to an oj-form-layout element, and the labelHint property is also specified.\n\n\nThe helpHints object contains a definition property and a source property.\n\n\ndefinition - hint for help definition text.\nsource - hint for help source URL.\n",
      "type": "Object.<string, string>",
      "displayName": "Help Hints",
      "value": "{definition: , source: }",
      "properties": {
        "definition": {
          "description": "Hint for help definition text associated with the label. \nIt is what shows up when the user hovers over the help icon, or tabs into the help icon, or press and holds the help icon on a mobile device. No formatted text is available for help definition attribute.\n\nSee the help-hints attribute for usage examples.",
          "type": "string"
        },
        "source": {
          "description": "Hint for help source URL associated with the label. \nIf present, a help icon will render next to the label. For security reasons we only support urls with protocol http: or https:. If the url doesn't comply we ignore it and throw an error. \nPass in an encoded URL since we do not encode the URL.\n\nSee the help-hints attribute for usage examples.",
          "type": "string"
        }
      }
    },
    "labelHint": {
      "description": "Represents a hint for oj-form-layout element to render a label on the editable component. \nThis is used only if the editable component is added as a direct child to an oj-form-layout element.\n\n\nWhen labelHint is present it gives a hint to the oj-form-layout element to create an oj-label element for the editable component.\nWhen the labelHint property changes oj-form-layout element refreshes to \ndisplay the updated label information. \n",
      "type": "string",
      "displayName": "Label Hint"
    },
    "max": {
      "description": "The maximum value of the slider. The max must not be less than the min, or else an Error is thrown during initialization.",
      "type": "number",
      "displayName": "Max",
      "value": null
    },
    "messagesCustom": {
      "description": "List of messages an app would add to the component when it has business/custom validation \nerrors that it wants the component to show. When this option is set the message shows to the \nuser right away. To clear the custom message, set messagesCustom\nback to an empty array.\nEach message in the array is an object that duck types oj.Message. \nSee Message for details.",
      "type": "Array.<Object>|undefined",
      "displayName": "Messages Custom",
      "value": "[]",
      "writeback": true
    },
    "min": {
      "description": "The minimum value of the slider. The min must not be greater than the max, or else an Error is thrown during initialization.",
      "type": "number",
      "displayName": "Min",
      "value": null
    },
    "orientation": {
      "description": "Specify the orientation of the slider.",
      "type": "string",
      "displayName": "Orientation",
      "value": "horizontal",
      "enumValues": [
        "horizontal",
        "vertical"
      ],
      "propertyEditorValues": {
        "horizontal": {
          "description": "Orient the slider horizontally.",
          "displayName": "Horizontal"
        },
        "vertical": {
          "description": "Orient the slider vertically.",
          "displayName": "Vertical"
        }
      }
    },
    "step": {
      "description": "Determines the size or amount of each interval or step the slider takes between min and max. The full specified value of the range (max - min) should be divisible by step.",
      "type": "number",
      "displayName": "Step",
      "value": 1
    },
    "translations": {
      "description": "A collection of translated resources from the translation bundle, or null if this\ncomponent has no resources. Resources may be accessed and overridden individually or collectively, as seen in the examples.\n\nIf this component has translations, their documentation immediately follows this doc entry.",
      "type": "Object",
      "displayName": "Translations",
      "value": null,
      "properties": {
        "invalidStep": {
          "description": "Invalid step value.\n\nSee the translations attribute for usage examples.",
          "type": "string",
          "value": "Invalid step; step must be > 0"
        },
        "maxMin": {
          "description": "Max is greater than min.\n\nSee the translations attribute for usage examples.",
          "type": "string",
          "value": "Max must not be less than min"
        },
        "noValue": {
          "description": "Missing value exception.\n\nSee the translations attribute for usage examples.",
          "type": "string",
          "value": "ojSlider has no value"
        },
        "optionNum": {
          "description": "The option is not a number.\n\nSee the translations attribute for usage examples.",
          "type": "string",
          "value": "{option} option is not a number"
        },
        "valueRange": {
          "description": "Value outside min to max range.\n\nSee the translations attribute for usage examples.",
          "type": "string",
          "value": "Value must be within min to max range"
        }
      }
    },
    "type": {
      "description": "The slider type determines whether the slider how the value is represented in the UI.",
      "type": "string",
      "displayName": "Type",
      "value": "fromMin",
      "enumValues": [
        "fromMax",
        "fromMin",
        "single"
      ],
      "propertyEditorValues": {
        "fromMax": {
          "description": "A single-thumb slider where the value bar goes from the slider thumb to the the slider max.",
          "displayName": "From Max"
        },
        "fromMin": {
          "description": "A single-thumb slider where the value bar goes from the slider min to the the slider thumb.",
          "displayName": "From Min"
        },
        "single": {
          "description": "A single-thumb slider where the value bar has no additional styling.",
          "displayName": "Single"
        }
      }
    },
    "value": {
      "description": "The numerical value of the slider. Note that the value attribute should be compatible with the type attribute, as described above. A value that is not compatible with the type will be coerced into a compatible value.",
      "type": "number",
      "displayName": "Value",
      "value": 0,
      "writeback": true
    }
  },
  "methods": {
    "refresh": {
      "description": "Called when the DOM underneath the component changes requiring a re-render of the component. An \nexample is when the id for the input changes. \n\nAnother time when refresh might be called is when the locale for the page changes. When it \nchanges, attributes used by its converter and validator that are locale specific, its hints, \nmessages and translations will be updated. \n\n\n\nWhen refresh method is called, the component may take various \nsteps such as clearing messages, running validation etc., based on the state it is in. \n\nSteps Performed Always\n\nThe converter and validators used by the component are reset, and new converter and \nvalidator hints is pushed to messaging. E.g., notewindow displays the new hint(s). \nRunning Validation\n\nif component is valid when refresh() is called, the display value is refreshed if component \nhas a converter set.\nif component is invalid and is showing messages when \nrefresh() is called, then all component messages are cleared \nand full validation run using the display value on the component. if there are validation errors, then value attribute is not updated and the error is shown. if no errors result from the validation, the value attribute is updated; page author can listen to the onValueChanged event to clear custom errors.\n\n\nif component is invalid and has deferred messages when refresh() \nis called, then all component messages are cleared and deferred validation is run.\n\n\n\nClearing Messages\n\nIf clearing messages only those created by the component are cleared.\nmessagesCustom attribute is not cleared.\n\n"
    },
    "reset": {
      "description": "Resets the component by clearing all messages and messages attributes - \nmessagesCustom -\nand updates the component's display value using the attribute value. User entered values will be \nerased when this method is called."
    },
    "showMessages": {
      "description": "Takes all deferred messages and shows them. \nIf there were no deferred messages this method simply returns. \n\n\nTo view messages user has to set focus on the component. \n"
    },
    "setProperty": {
      "description": "Sets a property or a single subproperty for complex properties and notifies the component\nof the change, triggering a [property]Changed event.",
      "params": [
        {
          "name": "property",
          "description": "The property name to set. Supports dot notation for subproperty access.",
          "type": "string"
        },
        {
          "name": "value",
          "description": "The new value to set the property to.",
          "type": "*"
        }
      ]
    },
    "getProperty": {
      "description": "Retrieves a value for a property or a single subproperty for complex properties.",
      "params": [
        {
          "name": "property",
          "description": "The property name to get. Supports dot notation for subproperty access.",
          "type": "string"
        }
      ],
      "return": "*"
    },
    "setProperties": {
      "description": "Performs a batch set of properties.",
      "params": [
        {
          "name": "properties",
          "description": "An object containing the property and value pairs to set.",
          "type": "Object"
        }
      ]
    }
  },
  "events": {
    "animateStart": {
      "description": "Triggered when a default animation is about to start on an element owned by the component.\n\nThe default animation can be cancelled by calling event.preventDefault, followed by\na call to ui.endCallback. ui.endCallback should be\ncalled immediately after event.preventDefault if the application merely wants to cancel animation, \nor it should be called when the custom animation ends if the application is invoking another animation function. Failure to\ncall ui.endCallback may prevent the component from working properly.\nFor more information on customizing animations, see the documentation of \noj.AnimationUtils.\n\nThe default animations are controlled via the theme (SCSS) :\n\n// default animations for \"notewindow\" display option\n$noteWindowOpenAnimation: (effect: \"zoomIn\", transformOrigin: \"#myPosition\") !default;\n$noteWindowCloseAnimation: (effect: \"none\") !default;\n\n// default animations for \"inline\" display option\n$messageInlineOpenAnimation: (effect: \"expand\", startMaxHeight: \"#oldHeight\") !default;\n$messageInlineCloseAnimation: (effect: \"collapse\", endMaxHeight: \"#newHeight\") !default;\n",
      "bubbles": true,
      "cancelable": true,
      "detail": {
        "action": {
          "description": "The action that triggers the animation. Supported values are: \"inline-open\" - when an inline message container opens or increases in size \"inline-close\" - when an inline message container closes or decreases in size \"notewindow-open\" - when a note window opens \"notewindow-close\" - when a note window closes ",
          "type": "string"
        },
        "element": {
          "description": "The element being animated.",
          "type": "Element"
        },
        "endCallback": {
          "description": "If the event listener calls event.preventDefault to cancel the default animation, it must call the endCallback function when it finishes its own animation handling and any custom animation has ended.",
          "type": "function"
        }
      }
    },
    "animateEnd": {
      "description": "Triggered when a default animation has ended.",
      "bubbles": true,
      "cancelable": true,
      "detail": {
        "action": {
          "description": "The action that triggers the animation. Supported values are: \"inline-open\" - when an inline message container opens or increases in size \"inline-close\" - when an inline message container closes or decreases in size \"notewindow-open\" - when a note window opens \"notewindow-close\" - when a note window closes ",
          "type": "string"
        },
        "element": {
          "description": "The element being animated.",
          "type": "Element"
        }
      }
    }
  },
  "slots": {
    "contextMenu": {
      "description": "The contextMenu slot is set on the oj-menu within this element. \nThis is used to designate the JET Menu that this component should launch as a context menu on right-click, Shift-F10, Press & Hold, or component-specific gesture. \nIf specified, the browser's native context menu will be replaced by the JET Menu specified in this slot.\n\nThe application can register a listener for the Menu's ojBeforeOpen event. The listener can cancel the launch via event.preventDefault(), \nor it can customize the menu contents by editing the menu DOM directly, and then calling refresh() on the Menu.\n\nTo help determine whether it's appropriate to cancel the launch or customize the menu, the ojBeforeOpen listener can use component API's to determine which \ntable cell, chart item, etc., is the target of the context menu. See the JSDoc and demos of the individual components for details. \n\nKeep in mind that any such logic must work whether the context menu was launched via right-click, Shift-F10, Press & Hold, or component-specific touch gesture."
    }
  }
}